Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Observables Are Flexible
zh_cn: Observables 是灵活的

source: Observables Are Less Opinionated
zh_cn: Observables 是无偏见的

source: Observables and observers are only the start of ReactiveX.
zh_cn: 对于 ReactiveX 来说，Observable 和观察者仅仅是个开始。

source: Observables can be implemented using thread-pools, event loops, non-blocking I/O, actors (such as from Akka), or whatever implementation suits your needs, your style, or your expertise.
zh_cn: 可以用任何方式来实现 Observable，使用线程池，事件循环，非阻塞 I/O，actor(例如来自 Akka)或任何适合您的需求，风格或专业知识。

source: Observables fill the gap by being the ideal way to access asynchronous sequences of multiple items
zh_cn: Observable 通过理想方式访问多个项的异步序列来填补空白

source: Obviously, even where a user selects to "wait," this is not necessary after the host has been "up" for at least MSL seconds.
zh_cn: 显然，即使用户选择“等待”，在主机已经“启动”至少 MSL 秒之后也不需要这样做。

source: Of course, suffixes of various kinds may appear together:
zh_cn: 当然，各种后缀可能会一起出现：

source: Of course, the arrival of an old duplicate "SYN" segment can potentially make it appear, to the recipient, that a simultaneous connection initiation is in progress.
zh_cn: 当然，旧的重复“SYN”报文段的到来可能使得向接收者显示同时连接启动正在进行中。

source: Of course, we can imitate other typical sources, such as an unbounded range with it:
zh_cn: 当然，我们可以模仿其他典型的来源，例如无限范围：

source: Of the request methods defined by this specification, PUT, DELETE, and safe request methods are idempotent.
zh_cn: 在本规范定义的请求方法中，PUT，DELETE 和安全请求方法是幂等的。

source: Of the request methods defined by this specification, the GET, HEAD, OPTIONS, and TRACE methods are defined to be safe.
zh_cn: 在本规范定义的请求方法中，GET，HEAD，OPTIONS 和 TRACE 方法被定义为安全的。

source: Often the fact that the extension fields are included in the inputs to the Finished message hashes will be sufficient, but extreme care is needed when the extension changes the meaning of messages sent in the handshake phase.
zh_cn: 通常，扩展字段包含在 Finished 消息散列的输入中这一事实就足够了，但是当扩展改变了握手阶段发送的消息的含义时，需要格外小心。

source: Often though there is a way that is somewhat more expressive (and also lower overhead) by using `Completable` as the mediator and its operator `andThen` to resume with something else:
zh_cn: 通常有一种方式更具表现力(也更低开销)，使用 `Completable` 作为调解器及其运算符 `andThen` 继续使用其他内容：

source: Old Duplicate SYN Initiates a Reset on two Passive Sockets
zh_cn: 旧的重复 SYN 在两个无源套接字上启动重置

source: Old return type
zh_cn: 旧返回类型

source: Older HTTP/1.0 user agent implementations might send an extra CRLF after a POST request as a workaround for some early server applications that failed to read message body content that was not terminated by a line-ending.
zh_cn: 较早的 HTTP/1.0 用户代理实现可能会在 POST 请求之后发送额外的 CRLF，作为某些早期服务器应用程序的解决方法，这些应用程序无法读取未通过行结束终止的消息正文内容。

source: On desktop Java, this latter handler does nothing on an `ExecutorService` backed `Scheduler` and the application can keep running.
zh_cn: 在桌面 Java 上，后一个处理程序对 `ExecutorService` 支持的 `Scheduler` 什么都不做，应用程序可以继续运行。

source: On the other hand, longer can represent up to 800 bytes of data, or 400 uint16 elements, and it may be empty.
zh_cn: 另一方面，longer 可以表示最多 800 个字节的数据，或 400 个 uint16 元素，并且它可能为空。（译注：uint16 为类型，0..800 表示合法长度，也就是最大长度是 800，而每个 uint16 占 2 个字节，所以最多可表示 400 个 uint，这与前面的 T T'[n] 中的 n 表示大小的倍数是不一样的）

source: On the sender side, the process for computing the signature field of the CertificateVerify message takes as input:
zh_cn: 在发送方，计算 CertificateVerify 消息的签名字段的过程作为输入：

source: Once a close has been signaled, the client MUST NOT send any more requests on that connection.
zh_cn: 一旦发出关闭信号，客户端就不能再在该连接上发送任何请求。

source: Once a connection is established this is always sent.
zh_cn: 建立连接后，始终会发送此字段。

source: Once a handshake has completed, the server can send the client a PSK identity that corresponds to a unique key derived from the initial handshake (see Section 4.6.1).
zh_cn: 一旦握手完成，服务器就可以向客户端发送 PSK 标识，该标识对应于从初始握手得到的唯一密钥(参见第 4.6.1 节)。

source: Once a record is deprotected successfully, it is treated as the start of the client's second flight and the server proceeds as with an ordinary 1-RTT handshake.
zh_cn: 一旦记录成功去保护，它将被视为客户端第二次飞行的开始，服务器将进行普通的 1-RTT 握手。

source: Once a side has sent its Finished message and has received and validated the Finished message from its peer, it may begin to send and receive Application Data over the connection.
zh_cn: 一旦一方已发送其 Finished 消息并已收到并验证来自其对等端的 Finished 消息，它就可以开始通过该连接发送和接收应用数据。

source: Once a side has sent its Finished message and received and validated the Finished message from its peer, it may begin to send and receive application data over the connection.
zh_cn: 一旦一方已经发送其 Finished 消息并且接收和验证对等端的 Finished 消息，它可以开始通过该连接发送和接收应用数据。

source: Once active, a tunnel is not considered a party to the HTTP communication, though the tunnel may have been initiated by an HTTP request.
zh_cn: 一旦激活，隧道不被视为 HTTP 通信的一方，尽管隧道可能已由 HTTP 请求启动。

source: Once active, a tunnel is not considered a party to the HTTP communication, though the tunnel might have been initiated by an HTTP request.
zh_cn: 一旦激活，隧道就不被视为 HTTP 通信的一方，尽管隧道可能是由 HTTP 请求发起的。

source: Once all the values which are to be derived from a given secret have been computed, that secret SHOULD be erased.
zh_cn: 一旦计算出从给定密钥导出的所有值，就应该删除该密钥。

source: Once an inbound connection is obtained, the client sends an HTTP request message (Section 3) with a request-target derived from the target URI.
zh_cn: 获得入站连接后，客户端将发送一条 HTTP 请求消息(第 3 节)，其中包含从目标 URI 派生的请求目标。

source: Once client_/server_application_traffic_secret_N+1 and its associated traffic keys have been computed, implementations SHOULD delete client_/server_application_traffic_secret_N and its associated traffic keys.
zh_cn: 一旦计算了 client_/server_application_traffic_secret_N + 1 及其关联的通信密钥，实现应该删除 client_/server_application_traffic_secret_N 及其关联的通信密钥。

source: Once defined, a standardized method ought to have the same semantics when applied to any resource, though each resource determines for itself whether those semantics are implemented or allowed.
zh_cn: 一旦定义，标准化方法在应用于任何资源时应该具有相同的语义，尽管每个资源自己确定是否实现或允许这些语义。

source: Once record protection has started, TLSPlaintext records are protected and sent as described in the following section.
zh_cn: 一旦记录保护开始，TLSPlaintext 记录将受到保护并按照以下部分所述发送。

source: Once the `compute(int)` finishes, the another value is then requested from `range`.
zh_cn: 一旦 `compute(int)` 完成，就会从 `range` 请求另一个值。

source: Once the data is ready, you can make sure they get processed on the foreground or GUI thread via `observeOn`.
zh_cn: 数据准备好后，您可以确保通过 `observeOn` 在前台或 GUI 线程上处理它们。

source: Once the effective request URI has been constructed, an origin server needs to decide whether or not to provide service for that URI via the connection in which the request was received.
zh_cn: 一旦构建了有效请求 URI，源服务器就需要决定是否通过接收请求的连接为该 URI 提供服务。

source: Once the handshake is complete, it is possible for either side to update its sending traffic keys using the KeyUpdate handshake message defined in Section 4.6.3.
zh_cn: 握手完成后，任何一方都可以使用第 4.6.3 节中定义的 KeyUpdate 握手消息更新其发送通信密钥。

source: Once the handshake is complete, the peers use the established keys to protect the application-layer traffic.
zh_cn: 握手完成后，对等端使用已建立的密钥来保护应用层流量。

source: Once the re-establishment is complete, the client and server MAY begin to exchange application layer data.
zh_cn: 一旦重建完成，客户端和服务器就可以开始交换应用层数据。

source: Once the scheme is determined, further scheme-specific parsing can be performed on the components.
zh_cn: 一旦确定了方案，就可以对组件执行进一步的特定于方案的解析。

source: Once the security parameters have been set and the keys have been generated, the connection states can be instantiated by making them the current states.
zh_cn: 一旦设置了安全参数并生成了密钥，就可以通过使连接状态成为当前状态来实例化连接状态。

source: Once the target URI is determined, a client needs to decide whether a network request is necessary to accomplish the desired semantics and, if so, where that request is to be directed.
zh_cn: 一旦确定了目标 URI，客户端就需要决定是否需要网络请求来完成所需的语义，如果需要，则需要确定该请求的定向位置。

source: One advantage of TLS is that it is application protocol independent.
zh_cn: TLS 的一个优点是它独立于应用程序协议。

source: One can think of it as a 0 capacity `onBackpressureBuffer` with strategy `ON_OVERFLOW_DROP_LATEST`.
zh_cn: 可以将其视为具有策略 `ON_OVERFLOW_DROP_LATEST` 的 0 容量 `onBackpressureBuffer`。

source: One can think of this as a variant of the `onBackpressureBuffer` with a capacity of 1 and strategy of `ON_OVERFLOW_DROP_OLDEST`.
zh_cn: 可以将其视为 `onBackpressureBuffer` 的变体，其容量为 1，策略为 `ON_OVERFLOW_DROP_OLDEST`。

source: One case where this would be appropriate is where a server has spawned a process to satisfy a request; the process might receive security parameters (key length, authentication, etc.) at startup, and it might be difficult to communicate changes to these parameters after that point.
zh_cn: 这种情况适合的一种情况是服务器产生了满足请求的进程；该过程可能在启动时接收安全参数(密钥长度，身份验证等)，并且在该点之后可能难以将这些参数的更改传达给它们。

source: One consequence of this flexibility is that the protocol cannot be defined in terms of what occurs behind the interface.
zh_cn: 这种灵活性的一个结果是协议不能根据接口背后的内容来定义。

source: One could, of course, turn that into an `Iterable` but when such sources are associated with resources, we may leak those resources if the downstream unsubscribes the sequence before it would end.
zh_cn: 当然，可以将其转换为 `Iterable`，但是当这些源与资源相关联时，如果下游在序列结束之前取消订阅序列，我们可能会泄漏这些资源。

source: One design goal of HTTP is to separate resource identification from request semantics, which is made possible by vesting the request semantics in the request method (Section 4) and a few request-modifying header fields (Section 5).
zh_cn: HTTP 的一个设计目标是将资源标识与请求语义分开，这可以通过将请求语义归入请求方法(第 4 节)和一些请求修改首部字段(第 5 节)来实现。

source: One example would be
zh_cn: 一个例子是

source: One important design requirement for 2.x is that no `Throwable` errors should be swallowed.
zh_cn: 2.x 的一个重要设计要求是不应忽略任何 `Throwable` 的错误。

source: One main point of difference is that functional reactive programming operates on values that change continuously over time, while ReactiveX operates on discrete values that are emitted over time.
zh_cn: 一个主要的不同点是函数性响应式编程对随时间变化的 continuously (连续) 值进行操作，而 ReactiveX 对随时间发射的 discrete (离散) 值进行操作。

source: One may optionally specify a value without its associated tag to force the width definition without defining a superfluous element.
zh_cn: 可以选择指定一个没有相关标签的值来强制宽度定义而不定义多余的元素。

source: One notable difference is that all our functional interfaces now define `throws Exception`.
zh_cn: 一个值得注意的区别是我们所有的函数接口现在都定义了 `throws Exception`。

source: One of the benefits is that changing `Flowable` to `Observable` here the test code part doesn't have to change at all due to the implicit type change of the `TestSubscriber` to `TestObserver`.
zh_cn: 其中一个好处是将 `Flowable` 改为 `Observable`，测试代码部分根本不需要改变，因为 `TestSubscriber` 隐式改为 `TestObserver`。

source: One of the common use cases for RxJava is to run some computation, network request on a background thread and show the results (or error) on the UI thread:
zh_cn: RxJava 的一个常见用例是在后台线程上运行一些计算，网络请求并在 UI 线程上显示结果(或错误)：

source: One of the content types supported by the TLS record layer is the alert type.
zh_cn: TLS 记录层支持的一种内容类型是警报类型。

source: One of the design flaws of RxJava 1.x was the exposure of the `rx.Observable.create()` method that while powerful, not the typical operator you want to use to enter the reactive world.
zh_cn: RxJava 1.x 的一个设计缺陷是 `rx.Observable.create()` 方法的曝光，虽然功能强大，但不是您想要用来进入响应世界的典型操作符。

source: One such encapsulated protocol, the TLS Handshake Protocol, allows the server and client to authenticate each other and to negotiate an encryption algorithm and cryptographic keys before the application protocol transmits or receives its first byte of data.
zh_cn: 一种这样的封装协议，即 TLS 握手协议，允许服务器和客户端相互认证，并在应用协议发送或接收其第一字节数据之前协商加密算法和加密密钥。

source: One version allows you to set this time out by means of a number of specified time units:
zh_cn: 一个版本允许您通过许多指定的时间单位设置此时间：

source: One version of merge takes a Single that emits a second Single and converts it into a Single that emits the item emitted by that second Single:
zh_cn: 一个合并的版本，需要一个 Single 发射第二个 Single 并将其转换为 Single，它发射第二个 Single 发射的项目：

source: One way to deal with this problem is to deliberately delay emitting segments for one MSL after recovery from a crash- this is the "quite time" specification.
zh_cn: 解决这个问题的一种方法是在从崩溃恢复后故意延迟一个 MSL 的发射报文段 - 这是“quite time”的规范。

source: One would be inclined to write such continuations as follows:
zh_cn: 人们倾向于写下如下的延续：

source: Only enumerateds of the same type may be assigned or compared.
zh_cn: 只能分配或比较相同类型的枚举。

source: Only the most common subcomponents are defined by this specification; other subcomponents may be defined by a URI scheme's specification, or by the implementation-specific syntax of a URI's dereferencing algorithm, provided that such subcomponents are delimited by characters in the reserved set allowed within that component.
zh_cn: 本规范仅定义了最常见的子组件；其他子组件可以由 URI 方案的规范定义，或者由 URI 的解除引用算法的特定于实现的语法定义，前提是这些子组件由该组件内允许的保留集中的字符分隔。

source: Operation
zh_cn: 操作

source: Operators By Category
zh_cn: 操作符分类

source: Operators marked as `@Beta` or `@Experimental` in 1.x are promoted to standard.
zh_cn: 在 1.x 中标记为 `@Beta` 或 `@Experimental` 的操作符将升级为标准操作符。

source: Operators of the new `Flowable` base reactive type now consider downstream request amounts properly, however, this doesn't mean `MissingBackpressureException` is gone.
zh_cn: 新的 `Flowable` 基本响应类型的运算符现在正确考虑下游请求数量，但是，这并不意味着 `MissingBackpressureException` 消失了。

source: Operators that evaluate one or more Observables or items emitted by Observables
zh_cn: 计算一个或多个 Observables 或 Observable 发射的项目的操作符

source: Operators that help to recover from error notifications from an Observable
zh_cn: 有助于从 Observable 发出的错误通知中恢复的操作符

source: Operators that operate on the entire sequence of items emitted by an Observable
zh_cn: 操作 Observable 发射的整个项目序列的操作符

source: Operators that originate new Observables.
zh_cn: 创建新 Observables 的操作符。

source: Operators that selectively emit items from a source Observable.
zh_cn: 有选择地从源 Observable 中发射项的操作符。

source: Operators that transform items that are emitted by an Observable.
zh_cn: 转换 Observable 发射的数据项的操作符。

source: Operators that work with multiple source Observables to create a single Observable
zh_cn: 使用多个源 Observable 创建单个 Observable 的操作符

source: Operators to Convert Observables
zh_cn: 转换 Observables 的操作符

source: Optional components are denoted by enclosing them in "[[ ]]" (double brackets).
zh_cn: 可选组件用“[[]]”(双括号)括起来表示。

source: Optional components are denoted by enclosing them in "[[ ]]" double brackets.
zh_cn: 可选组件用“[[]]”双括号括起来表示。

source: Optionally, the least-significant two pieces may instead be represented in IPv4 address textual format.
zh_cn: 可选地，最不重要的两个部分可以替代地以 IPv4 地址文本格式表示。

source: Options may occupy space at the end of the TCP header and are a multiple of 8 bits in length.
zh_cn: 选项可能占用 TCP 首部末尾的空间，并且长度为 8 位的倍数。

source: Or, something like this:
zh_cn: 或者，像这样：

source: Other URI schemes make the hierarchy explicit and visible to generic parsing algorithms.
zh_cn: 其他 URI 方案使层次结构对于通用解析算法显而易见且可见。

source: Other cipher suites MAY define their own MAC constructions, if needed.
zh_cn: 如果需要，其他密码套件可以定义自己的 MAC 结构。

source: Other extensions (see Section 4.2) are sent separately in the EncryptedExtensions message.
zh_cn: 其他扩展(请参阅第 4.2 节)在 EncryptedExtensions 消息中单独发送。

source: Other fields such as window, addresses, lengths, and text have been left out in the interest of clarity.
zh_cn: 为了清楚起见，省略了诸如窗口，地址，长度和文本之类的其他字段。

source: Other key exchange algorithms, such as those defined in [TLSECC], MUST specify whether the ServerKeyExchange message is sent or not;
zh_cn: 其他密钥交换算法，例如 [TLSECC] 中定义的那些，必须指定是否发送 ServerKeyExchange 消息；

source: Other pages show how you use the variety of Observable operators to link Observables together and change their behaviors.
zh_cn: 其他页面显示了如何使用 各种 Observable 运算符 将 Observable 链接在一起并更改其行为。

source: Other protocols might also be used to provide access to "http" identified resources -- it is only the authoritative interface that is specific to TCP.
zh_cn: 其他协议也可用于提供对“http”标识资源的访问 - 它只是特定于 TCP 的权威接口。

source: Other recipients SHOULD ignore unrecognized header fields.
zh_cn: 其他接收者应该忽略无法识别的首部字段。

source: Others are used for access control or to filter content.
zh_cn: 其他用于访问控制或过滤内容。

source: Others do not operate on any particular Scheduler, or operate on a particular default Scheduler.
zh_cn: 其他人不在任何特定的调度器上运行，或在特定的默认调度器上运行。

source: Otherwise (in the case of server authentication), this field SHALL be zero length.
zh_cn: 否则(在服务器认证的情况下)，该字段应为零长度。

source: Otherwise, a premature termination of the transport connection could lead to indeterminate results.
zh_cn: 否则，过早终止传输连接可能导致不确定的结果。

source: Otherwise, if the request is received over a TLS-secured TCP connection, the effective request URI's scheme is "https"; if not, the scheme is "http".
zh_cn: 否则，如果是通过 TLS 安全的 TCP 连接接收到请求，则有效请求 URI 的方案是“https”;如果没有，该方案是“http”。

source: Otherwise, it MUST be set as a zero-length vector (i.e., a zero-valued single byte length field).
zh_cn: 否则，必须将其设置为零长度 vector(即，零值单字节长度字段)。

source: Otherwise, it MUST be the first message sent by the client after it receives the ServerHelloDone message.
zh_cn: 否则，它必须是客户端收到 ServerHelloDone 消息后发送的第一条消息。

source: Otherwise, it is possible for the attacker to mount the attack described in [CBCATT].
zh_cn: 否则，攻击者可能会发起 [CBCATT] 中描述的攻击。

source: Otherwise, the (most specific) Common Name field in the Subject field of the certificate MUST be used.
zh_cn: 否则，必须使用证书的 Subject 字段中的(最具体的)Common Name 字段。

source: Otherwise, the authority component is assigned the default name configured for the server and, if the connection's incoming TCP port number differs from the default port for the effective request URI's scheme, then a colon (":") and the incoming port number (in decimal form) are appended to the authority component.
zh_cn: 否则，为权限组件分配为服务器配置的默认名称，如果连接的传入 TCP 端口号与有效请求 URI 的方案的默认端口不同，则冒号(“:”)和传入端口号(在十进制格式)附加到权限组件。

source: Otherwise, the client MUST process all extensions in the HelloRetryRequest and send a second updated ClientHello.
zh_cn: 否则，客户端必须处理 HelloRetryRequest 中的所有扩展并发送第二个更新的 ClientHello。

source: Otherwise, the client might not reliably receive the response message.
zh_cn: 否则，客户端可能无法可靠地接收响应消息。

source: Otherwise, the combined path and query component is the same as the request-target.
zh_cn: 否则，组合 path 和 query 组件与请求目标相同。

source: Otherwise, the effective request URI is constructed as follows:
zh_cn: 否则，有效请求 URI 构造如下：

source: Otherwise, this field will contain a different value identifying the new session.
zh_cn: 否则，该字段将包含标识新会话的不同值。

source: Otherwise, this is a response message without a declared message body length, so the message body length is determined by the number of octets received prior to the server closing the connection.
zh_cn: 否则，这是没有声明的消息体长度的响应消息，因此消息体长度由服务器关闭连接之前接收的八位字节数确定。

source: Otherwise, when sending the new ClientHello, the client MUST replace the original "key_share" extension with one containing only a new KeyShareEntry for the group indicated in the selected_group field of the triggering HelloRetryRequest.
zh_cn: 否则，在发送新的 ClientHello 时，客户端必须将原始的“key_share”扩展替换为仅包含触发 HelloRetryRequest 的 selected_group 字段中指示的组的新 KeyShareEntry 的扩展。

source: Our goal is to define all of the mechanisms necessary for HTTP message handling that are independent of message semantics, thereby defining the complete set of requirements for message parsers and message-forwarding intermediaries.
zh_cn: 我们的目标是定义独立于消息语义的 HTTP 消息处理所需的所有机制，从而为消息解析器和消息转发中介定义完整的需求集。

source: Our use of the terms "identify" and "identifying" refer to this purpose of distinguishing one resource from all other resources, regardless of how that purpose is accomplished (e.g., by name, address, or context).
zh_cn: 我们对术语“identify”和“identifying”的使用指的是将一种资源与所有其他资源区分开的目的，而不管如何实现该目的(例如，通过名称，地址或上下文)。

source: Overall Operation
zh_cn: 整体运作

source: Overview
zh_cn: 概述

source: Overview of Status Codes
zh_cn: 状态代码概述

source: Overview of URI
zh_cn: URI 概述

source: Overview of URIs
zh_cn: URI 概述

source: PHILOSOPHY
zh_cn: 哲学

source: PKIX RFCs define a variety of certificate extension OIDs and their corresponding value types.
zh_cn: PKIX RFC 定义了各种证书扩展 OID 及其对应的值类型。

source: POST is designed to allow a uniform method to cover the following functions:
zh_cn: POST 旨在允许统一的方法来涵盖以下功能：

source: POST requests MUST obey the message transmission requirements set out in section 8.2.
zh_cn: POST 请求必须遵守 8.2 节中规定的消息传输要求。

source: PREFACE
zh_cn: 前言

source: PSH: Push Function
zh_cn: PSH：推送功能

source: PSKs can be used with (EC)DHE key exchange in order to provide forward secrecy in combination with shared keys, or can be used alone, at the cost of losing forward secrecy for the application data.
zh_cn: PSK 可以与(EC)DHE 密钥交换一起使用，以便与共享密钥一起提供前向保密，或者可以单独使用，代价是丢失应用数据的前向保密性。

source: PUT requests MUST obey the message transmission requirements set out in section 8.2.
zh_cn: PUT 请求必须遵守 8.2 节中规定的消息传输要求。

source: P_hash can be iterated as many times as necessary to produce the required quantity of data.
zh_cn: 可以根据需要多次迭代 P_hash 以产生所需数量的数据。

source: Padding that is added to force the length of the plaintext to be an integral multiple of the block cipher's block length.
zh_cn: 添加的填充以强制明文的长度为分组加密的块长度的整数倍。

source: Parameter types may be defined by scheme-specific semantics, but in most cases the syntax of a parameter is specific to the implementation of the URI's dereferencing algorithm.
zh_cn: 参数类型可以由特定于方案的语义定义，但在大多数情况下，参数的语法特定于 URI 的解除引用算法的实现。

source: Parameter values might or might not be case-sensitive, depending on the semantics of the parameter name.
zh_cn: 参数值可能是也可能不区分大小写，具体取决于参数名称的语义。

source: Parameters MAY follow the type/subtype in the form of attribute/value pairs (as defined in section 3.6).
zh_cn: 参数可以以属性/值对的形式遵循类型/子类型(如第 3.6 节中所定义)。

source: Parameters are in the form of attribute/value pairs.
zh_cn: 参数采用属性/值对的形式。

source: Parsing an HTTP message as a stream of Unicode characters, without regard for the specific encoding, creates security vulnerabilities due to the varying ways that string processing libraries handle invalid multibyte character sequences that contain the octet LF (%x0A).
zh_cn: 将 HTTP 消息解析为 Unicode 字符流，而不考虑特定的编码，会由于字符串处理库处理包含八位字节 LF (%x0A) 的无效多字节字符序列的方式不同而造成安全漏洞。

source: Patch 2.x.y increments (such as 2.0.0 -> 2.0.1, 2.3.1 -> 2.3.2, etc) will occur for bug fixes and trivial functionality (like adding a method overload).
zh_cn: 补丁 2.x.y 增量(如 2.0.0->2.0.1、2.3.1->2.3.2 等)将出现在 bug 修复和琐碎功能(如添加方法重载)上。

source: Payload Semantics
zh_cn: 有效载荷语义

source: Payload header fields are defined in other parts of this specification, due to their impact on message parsing.
zh_cn: Payload 首部字段在本规范的其他部分中定义，因为它们对消息解析有影响。

source: Peers MUST validate each other's public key Y by ensuring that 1 < Y < p-1.
zh_cn: 同行必须通过确保 1 < Y < p-1 来验证彼此的公钥 Y。

source: Percent-Encoding
zh_cn: 百分号编码

source: Percent-encoding a reserved character, or decoding a percent-encoded octet that corresponds to a reserved character, will change how the URI is interpreted by most applications.
zh_cn: 对保留字符进行百分比编码，或解码与保留字符对应的百分比编码八位字节，将改变大多数应用程序解释 URI 的方式。

source: Persistence
zh_cn: 持久

source: Persistent Connections
zh_cn: 持久连接

source: Persistent Connections and Flow Control
zh_cn: 持久连接和流量控制

source: Persistent HTTP connections have a number of advantages:
zh_cn: 持久 HTTP 连接有许多优点：

source: Persistent connections provide a mechanism by which a client and a server can signal the close of a TCP connection.
zh_cn: 持久连接提供了一种机制，通过该机制，客户端和服务器可以发出 TCP 连接关闭的信号。

source: Personal Information
zh_cn: 个人信息

source: Pipelining
zh_cn: 流水线

source: Pipelining allows a client to make multiple requests without waiting for each response, allowing a single TCP connection to be used much more efficiently, with much lower elapsed time.
zh_cn: 流水线技术允许客户端在不等待每个响应的情况下发出多个请求，从而允许更有效地使用单个 TCP 连接，并且使用时间更短。
